Performance_test/tsung.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="info">
<clients>
    <client host="localhost" cpu="1" use_controller_vm="true" maxusers="20000"/>
  </clients>
<servers>
    <server host="223.202.123.4" port="8842" type="tcp"/>
  </servers>
<load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="100" unit="second"/>
    </arrivalphase>
  </load>
<sessions>
    <session name="es_load" weight="1" type="ts_http">
      <request>
<http url = "/bid/test" method = "POST" contents_from_file = "/root/bid_msg.json">
    <http_header name="Expect" value=""/>
</http >
      </request>
    </session>
  </sessions>
</tsung>